<?xml version="1.0"?>
<net name="runtime_gpu_graph" version="11">
	<layers>
		<layer id="1" name="input_ids" type="Input">
			<data shape="1,?" element_type="i64" execOrder="0" execTimeMcs="1" originalLayersNames="input_ids" outputLayouts="bfyx" outputPrecisions="I64" primitiveType="undef" runtimePrecision="I64" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="attention_mask" type="Input">
			<data shape="1,?" element_type="i64" execOrder="1" execTimeMcs="0" originalLayersNames="attention_mask" outputLayouts="bfyx" outputPrecisions="I64" primitiveType="undef" runtimePrecision="I64" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="parameter:input_ids_cldnn_input_preprocess" type="Reorder">
			<data execOrder="382" execTimeMcs="3" originalLayersNames="input_ids" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="reorder_data__i64" runtimePrecision="I64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Shape_3" type="shape_of">
			<data execOrder="384" execTimeMcs="10" originalLayersNames="Shape_3" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="shape_of_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Gather_52227" type="Gather">
			<data execOrder="390" execTimeMcs="2" originalLayersNames="Gather_52227,Slice_9/Clamp15236" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="gather_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Slice_9/End" type="Concat">
			<data execOrder="395" execTimeMcs="4" originalLayersNames="Slice_9/End" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="concatenation_gpu_simple_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Slice_9" type="StridedSlice">
			<data execOrder="397" execTimeMcs="4" originalLayersNames="Slice_9" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="undef" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Equal_19" type="Eltwise">
			<data execOrder="389" execTimeMcs="2" originalLayersNames="Equal_19" outputLayouts="bfyx" outputPrecisions="U8" primitiveType="generic_eltwise_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Where_20" type="select">
			<data execOrder="393" execTimeMcs="5" originalLayersNames="Where_20" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="select_gpu_ref__u8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Expand_21" type="broadcast">
			<data execOrder="398" execTimeMcs="2" originalLayersNames="Expand_21" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="broadcast_gpu_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Gather_412251" type="Gather">
			<data execOrder="386" execTimeMcs="32" originalLayersNames="Gather_412251" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="gather_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Equal_30" type="Eltwise">
			<data execOrder="387" execTimeMcs="3" originalLayersNames="Equal_30,Not_31" outputLayouts="bfyx" outputPrecisions="U8" primitiveType="generic_eltwise_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Cast_32" type="Reorder">
			<data execOrder="392" execTimeMcs="2" originalLayersNames="Cast_32" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="reorder_data__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="CumSum_34" type="cum_sum">
			<data execOrder="394" execTimeMcs="16" originalLayersNames="CumSum_34" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="cum_sum_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Mul_37" type="Eltwise">
			<data execOrder="396" execTimeMcs="3" originalLayersNames="Mul_37,Add_40" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="generic_eltwise_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Gather_442153" type="Gather">
			<data execOrder="399" execTimeMcs="18" originalLayersNames="Gather_442153" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="gather_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Gather_422063" type="Gather">
			<data execOrder="400" execTimeMcs="19" originalLayersNames="Gather_422063,Add_43,Add_45" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="gather_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Div_54" type="MVN">
			<data execOrder="401" execTimeMcs="103" originalLayersNames="Div_54" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="mvn_gpu_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Mul_55" type="Eltwise">
			<data execOrder="402" execTimeMcs="20" originalLayersNames="Mul_55,Add_56" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="MatMul_57" type="FullyConnected">
			<data execOrder="405" execTimeMcs="19669" originalLayersNames="MatMul_57" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Add_58" type="Eltwise">
			<data execOrder="408" execTimeMcs="50" originalLayersNames="Add_58" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Reshape_93" type="Reshape">
			<data execOrder="411" execTimeMcs="not_executed" originalLayersNames="Reshape_93" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Transpose_94" type="Permute">
			<data execOrder="414" execTimeMcs="15" originalLayersNames="Transpose_94" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="MatMul_59" type="FullyConnected">
			<data execOrder="404" execTimeMcs="19810" originalLayersNames="MatMul_59" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Add_60" type="Eltwise">
			<data execOrder="407" execTimeMcs="20" originalLayersNames="Add_60" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_70" type="Reshape">
			<data execOrder="410" execTimeMcs="not_executed" originalLayersNames="Reshape_70" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Transpose_95" type="Permute">
			<data execOrder="413" execTimeMcs="56" originalLayersNames="Transpose_95,Div_98_copy" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="parameter:attention_mask_cldnn_input_preprocess" type="Reorder">
			<data execOrder="383" execTimeMcs="3" originalLayersNames="attention_mask" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="reorder_data__i64" runtimePrecision="I64" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Unsqueeze_23/Unsqueeze" type="Reshape">
			<data execOrder="385" execTimeMcs="not_executed" originalLayersNames="Unsqueeze_23/Unsqueeze" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="undef" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Cast_24" type="Reorder">
			<data execOrder="388" execTimeMcs="3" originalLayersNames="Cast_24" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="reorder_data__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Sub_26/neg_/Fused_Mul_" type="Eltwise">
			<data execOrder="391" execTimeMcs="3" originalLayersNames="Sub_26/neg_/Fused_Mul_,Sub_26/Fused_Add_" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="10" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="11" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="12" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="MatMul_96" type="Gemm">
			<data execOrder="415" execTimeMcs="417" originalLayersNames="MatMul_96,Add_99" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="gemm_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Softmax_100/FlattenONNX_/input_shape" type="shape_of">
			<data execOrder="416" execTimeMcs="2" originalLayersNames="Softmax_100/FlattenONNX_/input_shape" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="shape_of_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Softmax_100/FlattenONNX_/input_shape/Gather" type="Gather">
			<data execOrder="417" execTimeMcs="2" originalLayersNames="Softmax_100/FlattenONNX_/input_shape/Gather" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="gather_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Softmax_100/FlattenONNX_/first_dims" type="Reduce">
			<data execOrder="418" execTimeMcs="1" originalLayersNames="Softmax_100/FlattenONNX_/first_dims" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="reduce_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Softmax_100/FlattenONNX_/first_dims/shapes_concat" type="Concat">
			<data execOrder="419" execTimeMcs="4" originalLayersNames="Softmax_100/FlattenONNX_/first_dims/shapes_concat" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="concatenation_gpu_simple_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Softmax_100/FlattenONNX_/Reshape" type="Reshape">
			<data execOrder="420" execTimeMcs="not_executed" originalLayersNames="Softmax_100/FlattenONNX_/Reshape" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Softmax_100/Softmax_" type="SoftMax">
			<data execOrder="421" execTimeMcs="553" originalLayersNames="Softmax_100/Softmax_" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="softmax_gpu_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Softmax_100" type="Reshape">
			<data execOrder="422" execTimeMcs="not_executed" originalLayersNames="Softmax_100" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="MatMul_71" type="FullyConnected">
			<data execOrder="403" execTimeMcs="19832" originalLayersNames="MatMul_71" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Add_72" type="Eltwise">
			<data execOrder="406" execTimeMcs="20" originalLayersNames="Add_72" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Reshape_82" type="Reshape">
			<data execOrder="409" execTimeMcs="not_executed" originalLayersNames="Reshape_82" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Transpose_83" type="Permute">
			<data execOrder="412" execTimeMcs="30" originalLayersNames="Transpose_83" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="MatMul_101" type="Gemm">
			<data execOrder="423" execTimeMcs="483" originalLayersNames="MatMul_101" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="gemm_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Transpose_102" type="Permute">
			<data execOrder="424" execTimeMcs="31" originalLayersNames="Transpose_102" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_112" type="Reshape">
			<data execOrder="425" execTimeMcs="not_executed" originalLayersNames="Reshape_112" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="MatMul_113" type="FullyConnected">
			<data execOrder="426" execTimeMcs="19979" originalLayersNames="MatMul_113" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Add_114" type="Eltwise">
			<data execOrder="427" execTimeMcs="29" originalLayersNames="Add_114,Add_115" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Div_124" type="MVN">
			<data execOrder="428" execTimeMcs="101" originalLayersNames="Div_124" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="mvn_gpu_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Mul_125" type="Eltwise">
			<data execOrder="429" execTimeMcs="20" originalLayersNames="Mul_125,Add_126" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="MatMul_127" type="FullyConnected">
			<data execOrder="430" execTimeMcs="78333" originalLayersNames="MatMul_127" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Add_128" type="Eltwise">
			<data execOrder="431" execTimeMcs="158" originalLayersNames="Add_128,Mul_136" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="MatMul_137" type="FullyConnected">
			<data execOrder="432" execTimeMcs="78084" originalLayersNames="MatMul_137" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Add_138" type="Eltwise">
			<data execOrder="433" execTimeMcs="47" originalLayersNames="Add_138,Add_139" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Div_148" type="MVN">
			<data execOrder="434" execTimeMcs="104" originalLayersNames="Div_148" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="mvn_gpu_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Mul_149" type="Eltwise">
			<data execOrder="435" execTimeMcs="21" originalLayersNames="Mul_149,Add_150" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="MatMul_151" type="FullyConnected">
			<data execOrder="438" execTimeMcs="19662" originalLayersNames="MatMul_151" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Add_152" type="Eltwise">
			<data execOrder="441" execTimeMcs="49" originalLayersNames="Add_152" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Reshape_187" type="Reshape">
			<data execOrder="444" execTimeMcs="not_executed" originalLayersNames="Reshape_187" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Transpose_188" type="Permute">
			<data execOrder="447" execTimeMcs="14" originalLayersNames="Transpose_188" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="MatMul_153" type="FullyConnected">
			<data execOrder="437" execTimeMcs="19708" originalLayersNames="MatMul_153" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Add_154" type="Eltwise">
			<data execOrder="440" execTimeMcs="20" originalLayersNames="Add_154" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_164" type="Reshape">
			<data execOrder="443" execTimeMcs="not_executed" originalLayersNames="Reshape_164" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transpose_189" type="Permute">
			<data execOrder="446" execTimeMcs="43" originalLayersNames="Transpose_189,Div_192_copy" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="MatMul_190" type="Gemm">
			<data execOrder="448" execTimeMcs="405" originalLayersNames="MatMul_190,Add_193" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="gemm_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Softmax_194/FlattenONNX_/input_shape" type="shape_of">
			<data execOrder="449" execTimeMcs="2" originalLayersNames="Softmax_194/FlattenONNX_/input_shape" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="shape_of_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Softmax_194/FlattenONNX_/input_shape/Gather" type="Gather">
			<data execOrder="450" execTimeMcs="2" originalLayersNames="Softmax_194/FlattenONNX_/input_shape/Gather" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="gather_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Softmax_194/FlattenONNX_/first_dims" type="Reduce">
			<data execOrder="451" execTimeMcs="1" originalLayersNames="Softmax_194/FlattenONNX_/first_dims" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="reduce_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Softmax_194/FlattenONNX_/first_dims/shapes_concat" type="Concat">
			<data execOrder="452" execTimeMcs="3" originalLayersNames="Softmax_194/FlattenONNX_/first_dims/shapes_concat" outputLayouts="bfyx" outputPrecisions="I32" primitiveType="concatenation_gpu_simple_ref__i32" runtimePrecision="I32" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Softmax_194/FlattenONNX_/Reshape" type="Reshape">
			<data execOrder="453" execTimeMcs="not_executed" originalLayersNames="Softmax_194/FlattenONNX_/Reshape" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Softmax_194/Softmax_" type="SoftMax">
			<data execOrder="454" execTimeMcs="546" originalLayersNames="Softmax_194/Softmax_" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="softmax_gpu_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Softmax_194" type="Reshape">
			<data execOrder="455" execTimeMcs="not_executed" originalLayersNames="Softmax_194" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="MatMul_165" type="FullyConnected">
			<data execOrder="436" execTimeMcs="19688" originalLayersNames="MatMul_165" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Add_166" type="Eltwise">
			<data execOrder="439" execTimeMcs="20" originalLayersNames="Add_166" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_176" type="Reshape">
			<data execOrder="442" execTimeMcs="not_executed" originalLayersNames="Reshape_176" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Transpose_177" type="Permute">
			<data execOrder="445" execTimeMcs="26" originalLayersNames="Transpose_177" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="MatMul_195" type="Gemm">
			<data execOrder="456" execTimeMcs="446" originalLayersNames="MatMul_195" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="gemm_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Transpose_196" type="Permute">
			<data execOrder="457" execTimeMcs="36" originalLayersNames="Transpose_196" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="permute_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Reshape_206" type="Reshape">
			<data execOrder="458" execTimeMcs="not_executed" originalLayersNames="Reshape_206" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="undef" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="MatMul_207" type="FullyConnected">
			<data execOrder="459" execTimeMcs="19682" originalLayersNames="MatMul_207" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Add_208" type="Eltwise">
			<data execOrder="460" execTimeMcs="36" originalLayersNames="Add_208,Add_209" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Div_218" type="MVN">
			<data execOrder="461" execTimeMcs="106" originalLayersNames="Div_218" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="mvn_gpu_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Mul_219" type="Eltwise">
			<data execOrder="462" execTimeMcs="21" originalLayersNames="Mul_219,Add_220" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="MatMul_221" type="FullyConnected">
			<data execOrder="463" execTimeMcs="78198" originalLayersNames="MatMul_221" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Add_222" type="Eltwise">
			<data execOrder="464" execTimeMcs="165" originalLayersNames="Add_222,Mul_230" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="MatMul_231" type="FullyConnected">
			<data execOrder="465" execTimeMcs="78111" originalLayersNames="MatMul_231" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="fully_connected_gpu_bfyx_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Add_232" type="Eltwise">
			<data execOrder="466" execTimeMcs="35" originalLayersNames="Add_232,Add_233" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Div_242" type="MVN">
			<data execOrder="467" execTimeMcs="101" originalLayersNames="Div_242" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="mvn_gpu_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Mul_243" type="Eltwise">
			<data execOrder="468" execTimeMcs="20" originalLayersNames="Mul_243,Add_244" outputLayouts="bfyx" outputPrecisions="FP32" primitiveType="generic_eltwise_ref__f32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="MatMul_245" type="FullyConnected">
